# Test work 67

## Task 67.2
Напишите программу, которая выводит буквы английского алфавита от a до z вместе с кодами из ASCII-таблицы.

**Подсказка:** Чтобы выводить символы как целые числа - используйте оператор static_cast.

## Task 67.3
Измените программу из последнего подраздела «Вложенные циклы while» так, чтобы она выводила следующее:
```
5 4 3 2 1
4 3 2 1
3 2 1
2 1
1
```

### Программа
```c++
#include <iostream>
 
int main() {
  int outer = 1;
  while (outer <= 5) {
    int inner = 1;
    while (inner <= outer)
      std::cout << inner++ << " ";
 
    // Вставляем символ новой строки в конце каждого ряда
    std::cout << "\n";
    ++outer;
  }
 
  return 0;
}
```

# Task 67.4
Теперь сделайте так, чтобы цифры выводились следующим образом (используя программу из предыдущего задания):
```
        1
      2 1
    3 2 1
  4 3 2 1
5 4 3 2 1
```

**Подсказка:** Разберитесь сначала, как вывести числа следующим образом:
```
X X X X 1
X X X 2 1
X X 3 2 1
X 4 3 2 1
5 4 3 2 1
```